package com.company.homeWork.Cycles;

import java.util.Scanner;

//Задача_11/Пользователь вводит целое положительное  число (N). Выведите числа в диапазоне от 1 до N, сумма четных цифр которых больше суммы нечетных.
public class Task_11 {
    public static void main(String[] args) {
        Scanner s = new Scanner(System.in);
        System.out.println("Введите число N");
        int N = s.nextInt();
        for (int i = 1; i <=N; i++) {


        }
    }
}
